<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Book;

class BookSeeder extends Seeder
{
    public function run(): void
    {
        $books = [
            [
                'BookName' => 'เขมจิราต้องรอด',
                'ISBN' => '9786166196634',
                'Price' => 474.05,
                'Pages' => 454,
                'Description' => '"เขมจิราต้องรอด" นวนิยายวายกระแสแรงที่ถูกสร้างเป็นซีรีส์สุดฮิต ผลงานจากนักเขียน "คาลิ" ถ่ายทอดเรื่องราวที่ผสานไสยศาสตร์ลี้ลับ ความดราม่า และความโรแมนติกได้อย่างลงตัว',
                'cover_image' => 'bookA.jpg',
                'CategoryID' => 5,
                'PublisherID' => 1,
                'AuthorID' => 1,
            ],
            [
                'BookName' => 'ดอกรักผลิบานที่กลางใจ เล่ม 15',
                'ISBN' => '9786166242331',
                'Price' => 175.00,
                'Pages' => 192,
                'Description' => 'สึมุกิ รินทาโร เด็กหนุ่มจากโรงเรียนชายล้วนระดับล่าง ได้คบกับวากุริ คาโอรุโกะ สาวน้อยจากโรงเรียนคุณหนู หลังเข้าสู่เดือนมกราคมในปีใหม่ รินทาโรก็ฉลองวันเกิดด้วยการไปเที่ยวธีมปาร์กกับเพื่อนๆจากทั้ง 2 โรงเรียน ในวันนั้น นัตสึซาวะ ซาคุ กับโฮชินะ สุบารุ นัดกันไปติวหนังสือแบบส่วนตัว ทำให้ระยะห่างระหว่างทั้งสองหดแคบลง',
                'cover_image' => 'book1.jpg',
                'CategoryID' => 4,
                'PublisherID' => 2,
                'AuthorID' => 2,
            ],
            [
                'BookName' => 'Sasi\'s Sketch book Thailand Diary BANGKOK',
                'ISBN' => '9786167422886',
                'Price' => 415.00,
                'Pages' => 160,
                'Description' => 'หนังสือบันทึกเที่ยวกรุงเทพฯ ด้วยภาพวาดสีน้ำและลายมือ เที่ยวกรุงเทพฯสไตล์ศศิ เดินเยอะ กินเยอะ วาดเยอะ คุ้ม รักนะกทม.',
                'cover_image' => 'bookC.jpg',
                'CategoryID' => 3,
                'PublisherID' => 3,
                'AuthorID' => 3,
            ],
            [
                'BookName' => 'ครอบครัวหนู 102 ตัว',
                'ISBN' => '9786161882365',
                'Price' => 247.50,
                'Pages' => 32,
                'Description' => 'ใต้ต้นไม้ใหญ่ต้นหนึ่ง เป็นบ้านของครอบครัวหนู ประกอบไปด้วย คุณพ่อหนู คุณแม่หนู และลูกๆ หนูอีก 100 ตัว วันหนึ่งครอบครัวหนูออกเดินทางไปเก็บสตอร์วเบอร์รี่เพื่อนำมาทำแยม พร้อมกันทั้งครอบครัวเป็นครั้งแรก การเดินทางไปเก็บสตอรว์เบอร์รี่ที่ต้องทั้งข้ามแปลงดอกไม้ กับบ่อนํ้าไป รวมถึงเจ้าแมวชื่อคาบุชอบไปเดินเล่นเตร็ดเตร่แถวนั้น เรื่องราวของเหล่าลูกหนูทั้ง 100 ตัวยังไม่เคยออกจากบ้านกันเลยจะเป็นอย่างไรนะ',
                'cover_image' => 'bookD.jpg',
                'CategoryID' => 6,
                'PublisherID' => 4,
                'AuthorID' => 4,
            ],

            // Art & Design
            [
                'BookName' => 'พลังศิลป์พลิกสมอง Your Brain on Art / Susan Magsamen และ Ivy Ross',
                'ISBN' => '9786168355541',
                'Price' => 395.00,
                'Pages' => 384,
                'Description' => 'เพราะได้บรรเลง นักดนตรีจึงปลดปล่อยไอเดียสดใหม่เพราะได้เต้นรำ ผู้ป่วยโรคพาร์กินสันจึงเดินเหินดีขึ้น เพราะได้ระบายสี ผู้คนจึงบรรเทาความเครียดกังวลลงใน 20 นาทีเพราะได้ชมมหรสพ สมองจึง ‘ทึ่ง’ จนมองโลกไม่เหมือนเดิม นี่ไม่ใช่ปาฏิหาริย์ แต่เป็นความอัศจรรย์แห่ง ‘พลังศิลป์’ ที่ร่ายมนตร์ ‘พลิกสมอง’!',
                'cover_image' => 'พลังศิลป์พลิกสมอง.jpg',
                'CategoryID' => 3,
                'PublisherID' => 5,
                'AuthorID' => 5,
            ],
            [
                'BookName' => 'My Playlist Kanis x 4EVE',
                'ISBN' => '9786165986045',
                'Price' => 295.00,
                'Pages' => 192,
                'Description' => '4 เพลงของ 4EVE ที่คุณหลงรัก ถูกถ่ายทอดในมุมมองใหม่ๆ อีกครั้งจากนักเขียนการ์ตูน Kanis ที่จะทำให้คุณกลับไปฟังเพลงนี้อีกครั้งแล้วรู้สึกน่ารักกว่าขึ้นกว่าเดิม',
                'cover_image' => 'My Playlist Kanis x 4EVE.jpg',
                'CategoryID' => 3,
                'PublisherID' => 6,
                'AuthorID' => 6,
            ],
            [
                'BookName' => 'สเกตช์ภาพและระบายสีน้ำ Sketch Design & Painting',
                'ISBN' => '9786165270588',
                'Price' => 115.43,
                'Pages' => 120,
                'Description' => 'เรียนรู้การสเกตช์ภาพและระบายสีน้ำ กิจกรรมยามว่างหรืองานอดิเรก อีกหนึ่งกิจกรรมที่ใช้อุปกรณ์เพียงไม่กี่อย่าง สามารถพกพาอุปกรณ์ไปได้ทุกที่ ที่อยากไป',
                'cover_image' => 'สเกตช์ภาพและระบายสีน้ำ.jpg',
                'CategoryID' => 3,
                'PublisherID' => 7,
                'AuthorID' => 7,
            ],
            [
                'BookName' => 'Local Business Design ปั้นธุรกิจต่างจังหวัด ด้วยงานออกแบบ',
                'ISBN' => '9786169477679',
                'Price' => 481.50,
                'Pages' => 200,
                'Description' => 'พื้นที่ธุรกิจทั้งหลาย ไม่ว่าจะเป็นร้านกาแฟ ร้านอาหาร ที่พัก และร้านค้าต่าง ๆ มีส่วนช่วยขับเคลื่อนย่านการท่องเที่ยว และเศรษฐกิจท้องถิ่นโดยเฉพาะในพื้นที่นอกกรุงเทพที่มีเรื่องราวเฉพาะตัวที่ไม่อาจเลียนแบบได้',
                'cover_image' => 'Local Business Design.jpg',
                'CategoryID' => 3,
                'PublisherID' => 8,
                'AuthorID' => 8,
            ],
        ];

        foreach ($books as $book) {
            Book::firstOrCreate(['ISBN' => $book['ISBN']], $book);
        }
    }
}
