<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Book;

class BookSeeder extends Seeder
{
    public function run(): void
    {
        $books = [
            [
                'BookName' => 'เขมจิราต้องรอด',
                'ISBN' => '9786166196634',
                'Price' => 474.05,
                'Pages' => 454,
                'Description' => '"เขมจิราต้องรอด" นวนิยายวายกระแสแรงที่ถูกสร้างเป็นซีรีส์สุดฮิต ผลงานจากนักเขียน "คาลิ" ถ่ายทอดเรื่องราวที่ผสานไสยศาสตร์ลี้ลับ ความดราม่า และความโรแมนติกได้อย่างลงตัว',
                'cover_image' => 'bookA.jpg',
                'CategoryID' => 5,
                'PublisherID' => 1,
                'AuthorID' => 1,
            ],
            [
                'BookName' => 'ดอกรักผลิบานที่กลางใจ เล่ม 15',
                'ISBN' => '9786166242331',
                'Price' => 175.00,
                'Pages' => 192,
                'Description' => 'สึมุกิ รินทาโร เด็กหนุ่มจากโรงเรียนชายล้วนระดับล่าง ได้คบกับวากุริ คาโอรุโกะ สาวน้อยจากโรงเรียนคุณหนู หลังเข้าสู่เดือนมกราคมในปีใหม่ รินทาโรก็ฉลองวันเกิดด้วยการไปเที่ยวธีมปาร์กกับเพื่อนๆจากทั้ง 2 โรงเรียน ในวันนั้น นัตสึซาวะ ซาคุ กับโฮชินะ สุบารุ นัดกันไปติวหนังสือแบบส่วนตัว ทำให้ระยะห่างระหว่างทั้งสองหดแคบลง',
                'cover_image' => 'book1.jpg',
                'CategoryID' => 4,
                'PublisherID' => 2,
                'AuthorID' => 2,
            ],
            [
                'BookName' => 'Sasi\'s Sketch book Thailand Diary BANGKOK',
                'ISBN' => '9786167422886',
                'Price' => 415.00,
                'Pages' => 160,
                'Description' => 'หนังสือบันทึกเที่ยวกรุงเทพฯ ด้วยภาพวาดสีน้ำและลายมือ เที่ยวกรุงเทพฯสไตล์ศศิ เดินเยอะ กินเยอะ วาดเยอะ คุ้ม รักนะกทม.',
                'cover_image' => 'bookC.jpg',
                'CategoryID' => 3,
                'PublisherID' => 3,
                'AuthorID' => 3,
            ],
            [
                'BookName' => 'ครอบครัวหนู 102 ตัว',
                'ISBN' => '9786161882365',
                'Price' => 247.50,
                'Pages' => 32,
                'Description' => 'ใต้ต้นไม้ใหญ่ต้นหนึ่ง เป็นบ้านของครอบครัวหนู ประกอบไปด้วย คุณพ่อหนู คุณแม่หนู และลูกๆ หนูอีก 100 ตัว วันหนึ่งครอบครัวหนูออกเดินทางไปเก็บสตอร์วเบอร์รี่เพื่อนำมาทำแยม พร้อมกันทั้งครอบครัวเป็นครั้งแรก การเดินทางไปเก็บสตอรว์เบอร์รี่ที่ต้องทั้งข้ามแปลงดอกไม้ กับบ่อนํ้าไป รวมถึงเจ้าแมวชื่อคาบุชอบไปเดินเล่นเตร็ดเตร่แถวนั้น เรื่องราวของเหล่าลูกหนูทั้ง 100 ตัวยังไม่เคยออกจากบ้านกันเลยจะเป็นอย่างไรนะ',
                'cover_image' => 'bookD.jpg',
                'CategoryID' => 6,
                'PublisherID' => 4,
                'AuthorID' => 4,
            ],
        ];

        foreach ($books as $book) {
            Book::firstOrCreate(['ISBN' => $book['ISBN']], $book);
        }
    }
}
