<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Book;

class BookSeeder extends Seeder
{
    public function run(): void
    {
        $books = [
            [
                'BookName' => 'เขมจิราต้องรอด',
                'ISBN' => '9786166196634',
                'Price' => 474.05,
                'Pages' => 454,
                'Description' => '"เขมจิราต้องรอด" นวนิยายวายกระแสแรงที่ถูกสร้างเป็นซีรีส์สุดฮิต ผลงานจากนักเขียน "คาลิ" ถ่ายทอดเรื่องราวที่ผสานไสยศาสตร์ลี้ลับ ความดราม่า และความโรแมนติกได้อย่างลงตัว',
                'cover_image' => 'bookA.jpg',
                'CategoryID' => 5,
                'PublisherID' => 1,
                'AuthorID' => 1,
            ],
            [
                'BookName' => 'ดอกรักผลิบานที่กลางใจ เล่ม 15',
                'ISBN' => '9786166242331',
                'Price' => 175.00,
                'Pages' => 192,
                'Description' => 'สึมุกิ รินทาโร เด็กหนุ่มจากโรงเรียนชายล้วนระดับล่าง ได้คบกับวากุริ คาโอรุโกะ สาวน้อยจากโรงเรียนคุณหนู หลังเข้าสู่เดือนมกราคมในปีใหม่ รินทาโรก็ฉลองวันเกิดด้วยการไปเที่ยวธีมปาร์กกับเพื่อนๆจากทั้ง 2 โรงเรียน ในวันนั้น นัตสึซาวะ ซาคุ กับโฮชินะ สุบารุ นัดกันไปติวหนังสือแบบส่วนตัว ทำให้ระยะห่างระหว่างทั้งสองหดแคบลง',
                'cover_image' => 'book1.jpg',
                'CategoryID' => 4,
                'PublisherID' => 2,
                'AuthorID' => 2,
            ],
            [
                'BookName' => 'Sasi\'s Sketch book Thailand Diary BANGKOK',
                'ISBN' => '9786167422886',
                'Price' => 415.00,
                'Pages' => 160,
                'Description' => 'หนังสือบันทึกเที่ยวกรุงเทพฯ ด้วยภาพวาดสีน้ำและลายมือ เที่ยวกรุงเทพฯสไตล์ศศิ เดินเยอะ กินเยอะ วาดเยอะ คุ้ม รักนะกทม.',
                'cover_image' => 'bookC.jpg',
                'CategoryID' => 3,
                'PublisherID' => 3,
                'AuthorID' => 3,
            ],
            [
                'BookName' => 'ครอบครัวหนู 102 ตัว',
                'ISBN' => '9786161882365',
                'Price' => 247.50,
                'Pages' => 32,
                'Description' => 'ใต้ต้นไม้ใหญ่ต้นหนึ่ง เป็นบ้านของครอบครัวหนู ประกอบไปด้วย คุณพ่อหนู คุณแม่หนู และลูกๆ หนูอีก 100 ตัว วันหนึ่งครอบครัวหนูออกเดินทางไปเก็บสตอร์วเบอร์รี่เพื่อนำมาทำแยม พร้อมกันทั้งครอบครัวเป็นครั้งแรก การเดินทางไปเก็บสตอรว์เบอร์รี่ที่ต้องทั้งข้ามแปลงดอกไม้ กับบ่อนํ้าไป รวมถึงเจ้าแมวชื่อคาบุชอบไปเดินเล่นเตร็ดเตร่แถวนั้น เรื่องราวของเหล่าลูกหนูทั้ง 100 ตัวยังไม่เคยออกจากบ้านกันเลยจะเป็นอย่างไรนะ',
                'cover_image' => 'bookD.jpg',
                'CategoryID' => 6,
                'PublisherID' => 4,
                'AuthorID' => 4,
            ],

            // Art & Design
            [
                'BookName' => 'พลังศิลป์พลิกสมอง Your Brain on Art / Susan Magsamen และ Ivy Ross',
                'ISBN' => '9786168355541',
                'Price' => 395.00,
                'Pages' => 384,
                'Description' => 'เพราะได้บรรเลง นักดนตรีจึงปลดปล่อยไอเดียสดใหม่เพราะได้เต้นรำ ผู้ป่วยโรคพาร์กินสันจึงเดินเหินดีขึ้น เพราะได้ระบายสี ผู้คนจึงบรรเทาความเครียดกังวลลงใน 20 นาทีเพราะได้ชมมหรสพ สมองจึง ‘ทึ่ง’ จนมองโลกไม่เหมือนเดิม นี่ไม่ใช่ปาฏิหาริย์ แต่เป็นความอัศจรรย์แห่ง ‘พลังศิลป์’ ที่ร่ายมนตร์ ‘พลิกสมอง’!',
                'cover_image' => 'พลังศิลป์พลิกสมอง.jpg',
                'CategoryID' => 3,
                'PublisherID' => 5,
                'AuthorID' => 5,
            ],
            [
                'BookName' => 'My Playlist Kanis x 4EVE',
                'ISBN' => '9786165986045',
                'Price' => 295.00,
                'Pages' => 192,
                'Description' => '4 เพลงของ 4EVE ที่คุณหลงรัก ถูกถ่ายทอดในมุมมองใหม่ๆ อีกครั้งจากนักเขียนการ์ตูน Kanis ที่จะทำให้คุณกลับไปฟังเพลงนี้อีกครั้งแล้วรู้สึกน่ารักกว่าขึ้นกว่าเดิม',
                'cover_image' => 'My Playlist Kanis x 4EVE.jpg',
                'CategoryID' => 3,
                'PublisherID' => 6,
                'AuthorID' => 6,
            ],
            [
                'BookName' => 'สเกตช์ภาพและระบายสีน้ำ Sketch Design & Painting',
                'ISBN' => '9786165270588',
                'Price' => 115.43,
                'Pages' => 120,
                'Description' => 'เรียนรู้การสเกตช์ภาพและระบายสีน้ำ กิจกรรมยามว่างหรืองานอดิเรก อีกหนึ่งกิจกรรมที่ใช้อุปกรณ์เพียงไม่กี่อย่าง สามารถพกพาอุปกรณ์ไปได้ทุกที่ ที่อยากไป',
                'cover_image' => 'สเกตช์ภาพและระบายสีน้ำ.jpg',
                'CategoryID' => 3,
                'PublisherID' => 7,
                'AuthorID' => 7,
            ],
            [
                'BookName' => 'Local Business Design ปั้นธุรกิจต่างจังหวัด ด้วยงานออกแบบ',
                'ISBN' => '9786169477679',
                'Price' => 481.50,
                'Pages' => 200,
                'Description' => 'พื้นที่ธุรกิจทั้งหลาย ไม่ว่าจะเป็นร้านกาแฟ ร้านอาหาร ที่พัก และร้านค้าต่าง ๆ มีส่วนช่วยขับเคลื่อนย่านการท่องเที่ยว และเศรษฐกิจท้องถิ่นโดยเฉพาะในพื้นที่นอกกรุงเทพที่มีเรื่องราวเฉพาะตัวที่ไม่อาจเลียนแบบได้',
                'cover_image' => 'Local Business Design.jpg',
                'CategoryID' => 3,
                'PublisherID' => 8,
                'AuthorID' => 8,
            ],
            [
                'BookName' => 'โตเกียวจ๋าเรามาสนิทกันเถอะ Bonding with Tokyo',
                'ISBN' => '9786167144924',
                'Price' => 430.00,
                'Pages' => 136,
                'Description' => 'หนังสือภาพวาดประกอบเรื่องแต่งขนาดสั้นจากหนังสือ Tokyo to Nakayoku Naritakute  ถ่ายทอดประสบการณ์ และอารมณ์ความรู้สึกของหลากหลายผู้คน ผ่านฤดูกาล และย่านต่างๆอันเป็นเอกลักษณ์ของโตเกียว',
                'cover_image' => 'โตเกียวจ๋าเรามาสนิทกันเถอะ.jpg',
                'CategoryID' => 3,
                'PublisherID' => 10,
                'AuthorID' => 10,
            ],
            [
                'BookName' => '(เล่ม 2) Accidentally Wes Anderson : Adventures',
                'ISBN' => '9789740219316',
                'Price' => 850.00,
                'Pages' => 368,
                'Description' => 'เล่มต่อของ Accidentally Wes Anderson โดย Wally Koval นำเสนอสถานที่รอบโลกที่มีเอกลักษณ์คล้ายคลึงกับสไตล์ภาพของภาพยนตร์ซึ่งกำกับภาพแบบเวส แอนเดอร์สัน โดย Accidentally Wes Anderson: Adventures จะยังคงพานักอ่านไปชมทั้งเมืองท่องเที่ยวและสถานที่ใหม่ๆ ในสหรัฐอเมริกา แคนาดา ละตินอเมริกา ยุโรป แอฟริกา เอเชีย โอเชียเนีย ไปจนถึงอาร์กติกและแอนตาร์กติกาเช่นเดียวกับเล่มแรก',
                'cover_image' => 'Accidentally Wes Anderson.jpg',
                'CategoryID' => 3,
                'PublisherID' => 11,
                'AuthorID' => 11,
            ],
            [
                'BookName' => '(เล่ม 2) Accidentally Wes Anderson : Adventures',
                'ISBN' => '9786163018113',
                'Price' => 350.00,
                'Pages' => 320,
                'Description' => 'ในภาพวาดยุคเดียวกัน กฎแห่งทัศนมิติช่วยให้จิตรกรวาดภาพทิวทัศน์ แสดงความใกล้ไกลออกมาได้อย่างเหมือนจริง   ผืนผ้าแคบๆ แบนๆ ผายออกเป็นโลกสามมิติอันกว้างใหญ่   ประวัติศาสตร์ศิลปะผ่านท้องฟ้าและก้อนเมฆ (Cloudspotting in Art) เล่าถึงวิวัฒนาการของงานศิลปะ กฎแห่งทัศนมิติ วิธีที่มนุษย์ทำความเข้าใจความใกล้ไกล ทำความเข้าใจโลกที่พวกเราอาศัยอยู่',
                'cover_image' => 'ประวัติศาสตร์ผ่านท้องฟ้าและก้อนเมฆชื่อเรื่อง.jpg',
                'CategoryID' => 3,
                'PublisherID' => 12,
                'AuthorID' => 12,
            ],
            [
                'BookName' => 'HISTORY PALETTE ประวัติศาสตร์มีสี',
                'ISBN' => '9786162986017',
                'Price' => 270.00,
                'Pages' => 224,
                'Description' => 'ประวัติศาสตร์ เมื่อสีไม่ได้เป็นเพียงแค่คลื่นความถี่ที่สะท้อนเข้าดวงตา แต่ยังเก็บเรื่องราวในประวัติศาสตร์เอาไว้ด้วย ครั้งหนึ่งดอกคาร์เนชั่น ‘สีแดง’ เป็นตัวแทนความรักของกษัตริย์และราชินีผู้เลอโฉมแห่งสเปนเมื่อห้าร้อยกว่าปีก่อน ‘สีเขียว’ เคยเป็นทั้งสีแห่งความมั่งคั่ง ตัวแทนความรักที่ผิดแผก และคร่าชีวิตผู้คน ‘สีม่วง’ กับสถานะที่สงวนไว้สำหรับชนชั้นปกครอง แต่แทบไม่เคยปรากฏบนธงชาติผืนใด ‘สีน้ำตาล’ กับสถานะสีราคาแพง เพราะเคยทำจากศพ ‘สีขาว’ ไม่ได้สะสมไว้เพียงเรื่องราวบริสุทธิ์ เช่นเดียวกับ ‘สีดำ’ ที่บางครั้งก็เป็นสีแห่งแสงสว่างและความหวัง รวมถึงการตั้งคำถามว่า ‘สีส้ม’ หรือผลส้มอะไรเกิดก่อนกัน',
                'cover_image' => 'HISTORY PALETTE.png',
                'CategoryID' => 3,
                'PublisherID' => 13,
                'AuthorID' => 12,
            ],
            [
                'BookName' => 'คู่มือเขียนบทหนัง 101 (ของแท้ต้องช่วยชีวิตแมว!) Save The Cat!',
                'ISBN' => '9786168355053',
                'Price' => 365.00,
                'Pages' => 192,
                'Description' => 'คู่มือเขียนบทหนังที่เจาะลึกศาสตร์แห่งการเขียนบทอย่างรอบด้านและอ่านง่าย ที่จะขัดเกลาเรื่องเล่าของคุณให้สมบูรณ์ยิ่งกว่าเดิม',
                'cover_image' => 'Save The Cat.png',
                'CategoryID' => 3,
                'PublisherID' => 5,
                'AuthorID' => 13,
            ],

            // Comics/Manga
            [
                'BookName' => 'Chainsaw Man เล่ม 10',
                'ISBN' => '9786165897372',
                'Price' => 90.00,
                'Pages' => 192,
                'Description' => 'เด็นจิ ที่หัวสมองเละเป็นโจ๊กจากความสิ้นหวังที่ไม่อาจปัดเป่า ไปขอความช่วยเหลือจาก มาคิมะ แต่ความสบายใจเพียงชั่ววูบกลับเป็นแค่บทเริ่มต้นของฝันร้าย...ในตอนที่ประตูที่ห้ามเปิดในหัวใจเด็นจิเปิดออก แผนการของมาคิมะและความลับของปิศาจเลื่อยยนต์ ก็สับสนวุ่นวาย กลายเป็นนรกที่เต็มไปด้วยเลือด!!',
                'cover_image' => 'Chainsaw Man.jpg',
                'CategoryID' => 4,
                'PublisherID' => 9,
                'AuthorID' => 9,
            ],
        ];

        foreach ($books as $book) {
            Book::firstOrCreate(['ISBN' => $book['ISBN']], $book);
        }
    }
}
